layer {
  name: "data"
  type: "AttentionData"
  top: "data"
  top: "dir0_TL_label"
  top: "dir0_BR_label"
  top: "dir1_TL_label"
  top: "dir1_BR_label"
  top: "dir2_TL_label"
  top: "dir2_BR_label"
  top: "dir3_TL_label"
  top: "dir3_BR_label"
  top: "dir4_TL_label"
  top: "dir4_BR_label"
  top: "dir5_TL_label"
  top: "dir5_BR_label"
  top: "dir6_TL_label"
  top: "dir6_BR_label"
  top: "dir7_TL_label"
  top: "dir7_BR_label"
  top: "dir8_TL_label"
  top: "dir8_BR_label"
  top: "dir9_TL_label"
  top: "dir9_BR_label"
  top: "dir10_TL_label"
  top: "dir10_BR_label"
  top: "dir11_TL_label"
  top: "dir11_BR_label"
  top: "dir12_TL_label"
  top: "dir12_BR_label"
  top: "dir13_TL_label"
  top: "dir13_BR_label"
  top: "dir14_TL_label"
  top: "dir14_BR_label"
  top: "dir15_TL_label"
  top: "dir15_BR_label"
  top: "dir16_TL_label"
  top: "dir16_BR_label"
  top: "dir17_TL_label"
  top: "dir17_BR_label"
  top: "dir18_TL_label"
  top: "dir18_BR_label"
  top: "dir19_TL_label"
  top: "dir19_BR_label"
  top: "cls_label"
  include {
    phase: TRAIN
  }
  attention_data_param {
    source: "1__DATA/PASCAL/train.txt"
    batch_size: 64
    num_class: 20
    input_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    cache_images: false
    root_folder: "/data1/PASCAL/VOCdevkit/VOC2007/"
  }
}

layer {
  name: "data"
  type: "AttentionData"
  top: "data"
  top: "dir0_TL_label"
  top: "dir0_BR_label"
  top: "dir1_TL_label"
  top: "dir1_BR_label"
  top: "dir2_TL_label"
  top: "dir2_BR_label"
  top: "dir3_TL_label"
  top: "dir3_BR_label"
  top: "dir4_TL_label"
  top: "dir4_BR_label"
  top: "dir5_TL_label"
  top: "dir5_BR_label"
  top: "dir6_TL_label"
  top: "dir6_BR_label"
  top: "dir7_TL_label"
  top: "dir7_BR_label"
  top: "dir8_TL_label"
  top: "dir8_BR_label"
  top: "dir9_TL_label"
  top: "dir9_BR_label"
  top: "dir10_TL_label"
  top: "dir10_BR_label"
  top: "dir11_TL_label"
  top: "dir11_BR_label"
  top: "dir12_TL_label"
  top: "dir12_BR_label"
  top: "dir13_TL_label"
  top: "dir13_BR_label"
  top: "dir14_TL_label"
  top: "dir14_BR_label"
  top: "dir15_TL_label"
  top: "dir15_BR_label"
  top: "dir16_TL_label"
  top: "dir16_BR_label"
  top: "dir17_TL_label"
  top: "dir17_BR_label"
  top: "dir18_TL_label"
  top: "dir18_BR_label"
  top: "dir19_TL_label"
  top: "dir19_BR_label"
  top: "cls_label"
  include {
    phase: TEST
  }
  attention_data_param {
    source: "1__DATA/PASCAL/val.txt"
    batch_size: 32
    num_class: 20
    input_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    cache_images: false
    root_folder: "/data1/PASCAL/VOCdevkit/VOC2007/"
  }
}

layer {
  name: "conv1/7x7_s2"
  type: "Convolution"
  bottom: "data"
  top: "conv1/7x7_s2"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    group: 1
    stride: 2
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "conv1/7x7_s2/bn"
  type: "BN"
  bottom: "conv1/7x7_s2"
  top: "conv1/7x7_s2/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "conv1/relu_7x7"
  type: "ReLU"
  bottom: "conv1/7x7_s2/bn"
  top: "conv1/7x7_s2/bn"
}

layer {
  name: "pool1/3x3_s2"
  type: "Pooling"
  bottom: "conv1/7x7_s2/bn"
  top: "pool1/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}

layer {
  name: "conv2/3x3_reduce"
  type: "Convolution"
  bottom: "pool1/3x3_s2"
  top: "conv2/3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "conv2/3x3_reduce/bn"
  type: "BN"
  bottom: "conv2/3x3_reduce"
  top: "conv2/3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "conv2/relu_3x3_reduce"
  type: "ReLU"
  bottom: "conv2/3x3_reduce/bn"
  top: "conv2/3x3_reduce/bn"
}

layer {
  name: "conv2/3x3"
  type: "Convolution"
  bottom: "conv2/3x3_reduce/bn"
  top: "conv2/3x3"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "conv2/3x3/bn"
  type: "BN"
  bottom: "conv2/3x3"
  top: "conv2/3x3/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "conv2/relu_3x3"
  type: "ReLU"
  bottom: "conv2/3x3/bn"
  top: "conv2/3x3/bn"
}

layer {
  name: "pool2/3x3_s2"
  type: "Pooling"
  bottom: "conv2/3x3/bn"
  top: "pool2/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}

layer {
  name: "inception_3a/1x1"
  type: "Convolution"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/1x1"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/1x1/bn"
  type: "BN"
  bottom: "inception_3a/1x1"
  top: "inception_3a/1x1/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/relu_1x1"
  type: "ReLU"
  bottom: "inception_3a/1x1/bn"
  top: "inception_3a/1x1/bn"
}

layer {
  name: "inception_3a/3x3_reduce"
  type: "Convolution"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/3x3_reduce/bn"
  type: "BN"
  bottom: "inception_3a/3x3_reduce"
  top: "inception_3a/3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce/bn"
  top: "inception_3a/3x3_reduce/bn"
}

layer {
  name: "inception_3a/3x3"
  type: "Convolution"
  bottom: "inception_3a/3x3_reduce/bn"
  top: "inception_3a/3x3"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/3x3/bn"
  type: "BN"
  bottom: "inception_3a/3x3"
  top: "inception_3a/3x3/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/relu_3x3"
  type: "ReLU"
  bottom: "inception_3a/3x3/bn"
  top: "inception_3a/3x3/bn"
}

layer {
  name: "inception_3a/double3x3_reduce"
  type: "Convolution"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/double3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/double3x3_reduce/bn"
  type: "BN"
  bottom: "inception_3a/double3x3_reduce"
  top: "inception_3a/double3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "inception_3a/double3x3_reduce/bn"
  top: "inception_3a/double3x3_reduce/bn"
}

layer {
  name: "inception_3a/double3x3a"
  type: "Convolution"
  bottom: "inception_3a/double3x3_reduce/bn"
  top: "inception_3a/double3x3a"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/double3x3a/bn"
  type: "BN"
  bottom: "inception_3a/double3x3a"
  top: "inception_3a/double3x3a/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/relu_double3x3a"
  type: "ReLU"
  bottom: "inception_3a/double3x3a/bn"
  top: "inception_3a/double3x3a/bn"
}

layer {
  name: "inception_3a/double3x3b"
  type: "Convolution"
  bottom: "inception_3a/double3x3a/bn"
  top: "inception_3a/double3x3b"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/double3x3b/bn"
  type: "BN"
  bottom: "inception_3a/double3x3b"
  top: "inception_3a/double3x3b/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/relu_double3x3b"
  type: "ReLU"
  bottom: "inception_3a/double3x3b/bn"
  top: "inception_3a/double3x3b/bn"
}

layer {
  name: "inception_3a/pool"
  type: "Pooling"
  bottom: "pool2/3x3_s2"
  top: "inception_3a/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "inception_3a/pool_proj"
  type: "Convolution"
  bottom: "inception_3a/pool"
  top: "inception_3a/pool_proj"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/pool_proj/bn"
  type: "BN"
  bottom: "inception_3a/pool_proj"
  top: "inception_3a/pool_proj/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3a/pool_proj/bn"
  top: "inception_3a/pool_proj/bn"
}

layer {
  name: "inception_3a/output"
  type: "Concat"
  bottom: "inception_3a/1x1/bn"
  bottom: "inception_3a/3x3/bn"
  bottom: "inception_3a/double3x3b/bn"
  bottom: "inception_3a/pool_proj/bn"
  top: "inception_3a/output"
}

layer {
  name: "inception_3b/1x1"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/1x1"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/1x1/bn"
  type: "BN"
  bottom: "inception_3b/1x1"
  top: "inception_3b/1x1/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/relu_1x1"
  type: "ReLU"
  bottom: "inception_3b/1x1/bn"
  top: "inception_3b/1x1/bn"
}

layer {
  name: "inception_3b/3x3_reduce"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/3x3_reduce/bn"
  type: "BN"
  bottom: "inception_3b/3x3_reduce"
  top: "inception_3b/3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3b/3x3_reduce/bn"
  top: "inception_3b/3x3_reduce/bn"
}

layer {
  name: "inception_3b/3x3"
  type: "Convolution"
  bottom: "inception_3b/3x3_reduce/bn"
  top: "inception_3b/3x3"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/3x3/bn"
  type: "BN"
  bottom: "inception_3b/3x3"
  top: "inception_3b/3x3/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/relu_3x3"
  type: "ReLU"
  bottom: "inception_3b/3x3/bn"
  top: "inception_3b/3x3/bn"
}

layer {
  name: "inception_3b/double3x3_reduce"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/double3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/double3x3_reduce/bn"
  type: "BN"
  bottom: "inception_3b/double3x3_reduce"
  top: "inception_3b/double3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "inception_3b/double3x3_reduce/bn"
  top: "inception_3b/double3x3_reduce/bn"
}

layer {
  name: "inception_3b/double3x3a"
  type: "Convolution"
  bottom: "inception_3b/double3x3_reduce/bn"
  top: "inception_3b/double3x3a"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/double3x3a/bn"
  type: "BN"
  bottom: "inception_3b/double3x3a"
  top: "inception_3b/double3x3a/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/relu_double3x3a"
  type: "ReLU"
  bottom: "inception_3b/double3x3a/bn"
  top: "inception_3b/double3x3a/bn"
}

layer {
  name: "inception_3b/double3x3b"
  type: "Convolution"
  bottom: "inception_3b/double3x3a/bn"
  top: "inception_3b/double3x3b"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/double3x3b/bn"
  type: "BN"
  bottom: "inception_3b/double3x3b"
  top: "inception_3b/double3x3b/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/relu_double3x3b"
  type: "ReLU"
  bottom: "inception_3b/double3x3b/bn"
  top: "inception_3b/double3x3b/bn"
}

layer {
  name: "inception_3b/pool"
  type: "Pooling"
  bottom: "inception_3a/output"
  top: "inception_3b/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "inception_3b/pool_proj"
  type: "Convolution"
  bottom: "inception_3b/pool"
  top: "inception_3b/pool_proj"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/pool_proj/bn"
  type: "BN"
  bottom: "inception_3b/pool_proj"
  top: "inception_3b/pool_proj/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3b/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3b/pool_proj/bn"
  top: "inception_3b/pool_proj/bn"
}

layer {
  name: "inception_3b/output"
  type: "Concat"
  bottom: "inception_3b/1x1/bn"
  bottom: "inception_3b/3x3/bn"
  bottom: "inception_3b/double3x3b/bn"
  bottom: "inception_3b/pool_proj/bn"
  top: "inception_3b/output"
}

layer {
  name: "inception_3c/3x3_reduce"
  type: "Convolution"
  bottom: "inception_3b/output"
  top: "inception_3c/3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3c/3x3_reduce/bn"
  type: "BN"
  bottom: "inception_3c/3x3_reduce"
  top: "inception_3c/3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3c/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3c/3x3_reduce/bn"
  top: "inception_3c/3x3_reduce/bn"
}

layer {
  name: "inception_3c/3x3"
  type: "Convolution"
  bottom: "inception_3c/3x3_reduce/bn"
  top: "inception_3c/3x3"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3c/3x3/bn"
  type: "BN"
  bottom: "inception_3c/3x3"
  top: "inception_3c/3x3/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3c/relu_3x3"
  type: "ReLU"
  bottom: "inception_3c/3x3/bn"
  top: "inception_3c/3x3/bn"
}

layer {
  name: "inception_3c/double3x3_reduce"
  type: "Convolution"
  bottom: "inception_3b/output"
  top: "inception_3c/double3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3c/double3x3_reduce/bn"
  type: "BN"
  bottom: "inception_3c/double3x3_reduce"
  top: "inception_3c/double3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3c/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "inception_3c/double3x3_reduce/bn"
  top: "inception_3c/double3x3_reduce/bn"
}

layer {
  name: "inception_3c/double3x3a"
  type: "Convolution"
  bottom: "inception_3c/double3x3_reduce/bn"
  top: "inception_3c/double3x3a"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3c/double3x3a/bn"
  type: "BN"
  bottom: "inception_3c/double3x3a"
  top: "inception_3c/double3x3a/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3c/relu_double3x3a"
  type: "ReLU"
  bottom: "inception_3c/double3x3a/bn"
  top: "inception_3c/double3x3a/bn"
}

layer {
  name: "inception_3c/double3x3b"
  type: "Convolution"
  bottom: "inception_3c/double3x3a/bn"
  top: "inception_3c/double3x3b"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3c/double3x3b/bn"
  type: "BN"
  bottom: "inception_3c/double3x3b"
  top: "inception_3c/double3x3b/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_3c/relu_double3x3b"
  type: "ReLU"
  bottom: "inception_3c/double3x3b/bn"
  top: "inception_3c/double3x3b/bn"
}

layer {
  name: "inception_3c/pool/3x3_s2"
  type: "Pooling"
  bottom: "inception_3b/output"
  top: "inception_3c/pool/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}

layer {
  name: "inception_3c/output"
  type: "Concat"
  bottom: "inception_3c/3x3/bn"
  bottom: "inception_3c/double3x3b/bn"
  bottom: "inception_3c/pool/3x3_s2"
  top: "inception_3c/output"
}

layer {
  name: "inception_4a/1x1"
  type: "Convolution"
  bottom: "inception_3c/output"
  top: "inception_4a/1x1"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 224
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/1x1/bn"
  type: "BN"
  bottom: "inception_4a/1x1"
  top: "inception_4a/1x1/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/relu_1x1"
  type: "ReLU"
  bottom: "inception_4a/1x1/bn"
  top: "inception_4a/1x1/bn"
}

layer {
  name: "inception_4a/3x3_reduce"
  type: "Convolution"
  bottom: "inception_3c/output"
  top: "inception_4a/3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/3x3_reduce/bn"
  type: "BN"
  bottom: "inception_4a/3x3_reduce"
  top: "inception_4a/3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_4a/3x3_reduce/bn"
  top: "inception_4a/3x3_reduce/bn"
}

layer {
  name: "inception_4a/3x3"
  type: "Convolution"
  bottom: "inception_4a/3x3_reduce/bn"
  top: "inception_4a/3x3"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/3x3/bn"
  type: "BN"
  bottom: "inception_4a/3x3"
  top: "inception_4a/3x3/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/relu_3x3"
  type: "ReLU"
  bottom: "inception_4a/3x3/bn"
  top: "inception_4a/3x3/bn"
}

layer {
  name: "inception_4a/double3x3_reduce"
  type: "Convolution"
  bottom: "inception_3c/output"
  top: "inception_4a/double3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/double3x3_reduce/bn"
  type: "BN"
  bottom: "inception_4a/double3x3_reduce"
  top: "inception_4a/double3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "inception_4a/double3x3_reduce/bn"
  top: "inception_4a/double3x3_reduce/bn"
}

layer {
  name: "inception_4a/double3x3a"
  type: "Convolution"
  bottom: "inception_4a/double3x3_reduce/bn"
  top: "inception_4a/double3x3a"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/double3x3a/bn"
  type: "BN"
  bottom: "inception_4a/double3x3a"
  top: "inception_4a/double3x3a/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/relu_double3x3a"
  type: "ReLU"
  bottom: "inception_4a/double3x3a/bn"
  top: "inception_4a/double3x3a/bn"
}

layer {
  name: "inception_4a/double3x3b"
  type: "Convolution"
  bottom: "inception_4a/double3x3a/bn"
  top: "inception_4a/double3x3b"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/double3x3b/bn"
  type: "BN"
  bottom: "inception_4a/double3x3b"
  top: "inception_4a/double3x3b/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/relu_double3x3b"
  type: "ReLU"
  bottom: "inception_4a/double3x3b/bn"
  top: "inception_4a/double3x3b/bn"
}

layer {
  name: "inception_4a/pool"
  type: "Pooling"
  bottom: "inception_3c/output"
  top: "inception_4a/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "inception_4a/pool_proj"
  type: "Convolution"
  bottom: "inception_4a/pool"
  top: "inception_4a/pool_proj"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/pool_proj/bn"
  type: "BN"
  bottom: "inception_4a/pool_proj"
  top: "inception_4a/pool_proj/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_4a/pool_proj/bn"
  top: "inception_4a/pool_proj/bn"
}

layer {
  name: "inception_4a/output"
  type: "Concat"
  bottom: "inception_4a/1x1/bn"
  bottom: "inception_4a/3x3/bn"
  bottom: "inception_4a/double3x3b/bn"
  bottom: "inception_4a/pool_proj/bn"
  top: "inception_4a/output"
}

layer {
  name: "inception_4b/1x1"
  type: "Convolution"
  bottom: "inception_4a/output"
  top: "inception_4b/1x1"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/1x1/bn"
  type: "BN"
  bottom: "inception_4b/1x1"
  top: "inception_4b/1x1/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/relu_1x1"
  type: "ReLU"
  bottom: "inception_4b/1x1/bn"
  top: "inception_4b/1x1/bn"
}

layer {
  name: "inception_4b/3x3_reduce"
  type: "Convolution"
  bottom: "inception_4a/output"
  top: "inception_4b/3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/3x3_reduce/bn"
  type: "BN"
  bottom: "inception_4b/3x3_reduce"
  top: "inception_4b/3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_4b/3x3_reduce/bn"
  top: "inception_4b/3x3_reduce/bn"
}

layer {
  name: "inception_4b/3x3"
  type: "Convolution"
  bottom: "inception_4b/3x3_reduce/bn"
  top: "inception_4b/3x3"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/3x3/bn"
  type: "BN"
  bottom: "inception_4b/3x3"
  top: "inception_4b/3x3/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/relu_3x3"
  type: "ReLU"
  bottom: "inception_4b/3x3/bn"
  top: "inception_4b/3x3/bn"
}

layer {
  name: "inception_4b/double3x3_reduce"
  type: "Convolution"
  bottom: "inception_4a/output"
  top: "inception_4b/double3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/double3x3_reduce/bn"
  type: "BN"
  bottom: "inception_4b/double3x3_reduce"
  top: "inception_4b/double3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "inception_4b/double3x3_reduce/bn"
  top: "inception_4b/double3x3_reduce/bn"
}

layer {
  name: "inception_4b/double3x3a"
  type: "Convolution"
  bottom: "inception_4b/double3x3_reduce/bn"
  top: "inception_4b/double3x3a"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/double3x3a/bn"
  type: "BN"
  bottom: "inception_4b/double3x3a"
  top: "inception_4b/double3x3a/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/relu_double3x3a"
  type: "ReLU"
  bottom: "inception_4b/double3x3a/bn"
  top: "inception_4b/double3x3a/bn"
}

layer {
  name: "inception_4b/double3x3b"
  type: "Convolution"
  bottom: "inception_4b/double3x3a/bn"
  top: "inception_4b/double3x3b"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/double3x3b/bn"
  type: "BN"
  bottom: "inception_4b/double3x3b"
  top: "inception_4b/double3x3b/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/relu_double3x3b"
  type: "ReLU"
  bottom: "inception_4b/double3x3b/bn"
  top: "inception_4b/double3x3b/bn"
}

layer {
  name: "inception_4b/pool"
  type: "Pooling"
  bottom: "inception_4a/output"
  top: "inception_4b/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "inception_4b/pool_proj"
  type: "Convolution"
  bottom: "inception_4b/pool"
  top: "inception_4b/pool_proj"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/pool_proj/bn"
  type: "BN"
  bottom: "inception_4b/pool_proj"
  top: "inception_4b/pool_proj/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4b/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_4b/pool_proj/bn"
  top: "inception_4b/pool_proj/bn"
}

layer {
  name: "inception_4b/output"
  type: "Concat"
  bottom: "inception_4b/1x1/bn"
  bottom: "inception_4b/3x3/bn"
  bottom: "inception_4b/double3x3b/bn"
  bottom: "inception_4b/pool_proj/bn"
  top: "inception_4b/output"
}

layer {
  name: "inception_4c/1x1"
  type: "Convolution"
  bottom: "inception_4b/output"
  top: "inception_4c/1x1"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/1x1/bn"
  type: "BN"
  bottom: "inception_4c/1x1"
  top: "inception_4c/1x1/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/relu_1x1"
  type: "ReLU"
  bottom: "inception_4c/1x1/bn"
  top: "inception_4c/1x1/bn"
}

layer {
  name: "inception_4c/3x3_reduce"
  type: "Convolution"
  bottom: "inception_4b/output"
  top: "inception_4c/3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/3x3_reduce/bn"
  type: "BN"
  bottom: "inception_4c/3x3_reduce"
  top: "inception_4c/3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_4c/3x3_reduce/bn"
  top: "inception_4c/3x3_reduce/bn"
}

layer {
  name: "inception_4c/3x3"
  type: "Convolution"
  bottom: "inception_4c/3x3_reduce/bn"
  top: "inception_4c/3x3"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/3x3/bn"
  type: "BN"
  bottom: "inception_4c/3x3"
  top: "inception_4c/3x3/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/relu_3x3"
  type: "ReLU"
  bottom: "inception_4c/3x3/bn"
  top: "inception_4c/3x3/bn"
}

layer {
  name: "inception_4c/double3x3_reduce"
  type: "Convolution"
  bottom: "inception_4b/output"
  top: "inception_4c/double3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/double3x3_reduce/bn"
  type: "BN"
  bottom: "inception_4c/double3x3_reduce"
  top: "inception_4c/double3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "inception_4c/double3x3_reduce/bn"
  top: "inception_4c/double3x3_reduce/bn"
}

layer {
  name: "inception_4c/double3x3a"
  type: "Convolution"
  bottom: "inception_4c/double3x3_reduce/bn"
  top: "inception_4c/double3x3a"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/double3x3a/bn"
  type: "BN"
  bottom: "inception_4c/double3x3a"
  top: "inception_4c/double3x3a/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/relu_double3x3a"
  type: "ReLU"
  bottom: "inception_4c/double3x3a/bn"
  top: "inception_4c/double3x3a/bn"
}

layer {
  name: "inception_4c/double3x3b"
  type: "Convolution"
  bottom: "inception_4c/double3x3a/bn"
  top: "inception_4c/double3x3b"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/double3x3b/bn"
  type: "BN"
  bottom: "inception_4c/double3x3b"
  top: "inception_4c/double3x3b/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/relu_double3x3b"
  type: "ReLU"
  bottom: "inception_4c/double3x3b/bn"
  top: "inception_4c/double3x3b/bn"
}

layer {
  name: "inception_4c/pool"
  type: "Pooling"
  bottom: "inception_4b/output"
  top: "inception_4c/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "inception_4c/pool_proj"
  type: "Convolution"
  bottom: "inception_4c/pool"
  top: "inception_4c/pool_proj"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/pool_proj/bn"
  type: "BN"
  bottom: "inception_4c/pool_proj"
  top: "inception_4c/pool_proj/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4c/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_4c/pool_proj/bn"
  top: "inception_4c/pool_proj/bn"
}

layer {
  name: "inception_4c/output"
  type: "Concat"
  bottom: "inception_4c/1x1/bn"
  bottom: "inception_4c/3x3/bn"
  bottom: "inception_4c/double3x3b/bn"
  bottom: "inception_4c/pool_proj/bn"
  top: "inception_4c/output"
}

layer {
  name: "inception_4d/1x1"
  type: "Convolution"
  bottom: "inception_4c/output"
  top: "inception_4d/1x1"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4d/1x1/bn"
  type: "BN"
  bottom: "inception_4d/1x1"
  top: "inception_4d/1x1/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4d/relu_1x1"
  type: "ReLU"
  bottom: "inception_4d/1x1/bn"
  top: "inception_4d/1x1/bn"
}

layer {
  name: "inception_4d/3x3_reduce"
  type: "Convolution"
  bottom: "inception_4c/output"
  top: "inception_4d/3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4d/3x3_reduce/bn"
  type: "BN"
  bottom: "inception_4d/3x3_reduce"
  top: "inception_4d/3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4d/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_4d/3x3_reduce/bn"
  top: "inception_4d/3x3_reduce/bn"
}

layer {
  name: "inception_4d/3x3"
  type: "Convolution"
  bottom: "inception_4d/3x3_reduce/bn"
  top: "inception_4d/3x3"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4d/3x3/bn"
  type: "BN"
  bottom: "inception_4d/3x3"
  top: "inception_4d/3x3/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4d/relu_3x3"
  type: "ReLU"
  bottom: "inception_4d/3x3/bn"
  top: "inception_4d/3x3/bn"
}

layer {
  name: "inception_4d/double3x3_reduce"
  type: "Convolution"
  bottom: "inception_4c/output"
  top: "inception_4d/double3x3_reduce"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4d/double3x3_reduce/bn"
  type: "BN"
  bottom: "inception_4d/double3x3_reduce"
  top: "inception_4d/double3x3_reduce/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4d/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "inception_4d/double3x3_reduce/bn"
  top: "inception_4d/double3x3_reduce/bn"
}

layer {
  name: "inception_4d/double3x3a"
  type: "Convolution"
  bottom: "inception_4d/double3x3_reduce/bn"
  top: "inception_4d/double3x3a"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4d/double3x3a/bn"
  type: "BN"
  bottom: "inception_4d/double3x3a"
  top: "inception_4d/double3x3a/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4d/relu_double3x3a"
  type: "ReLU"
  bottom: "inception_4d/double3x3a/bn"
  top: "inception_4d/double3x3a/bn"
}

layer {
  name: "inception_4d/double3x3b"
  type: "Convolution"
  bottom: "inception_4d/double3x3a/bn"
  top: "inception_4d/double3x3b"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
    lr_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4d/double3x3b/bn"
  type: "BN"
  bottom: "inception_4d/double3x3b"
  top: "inception_4d/double3x3b/bn"
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  param {
    lr_mult: 0.25
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "inception_4d/relu_double3x3b"
  type: "ReLU"
  bottom: "inception_4d/double3x3b/bn"
  top: "inception_4d/double3x3b/bn"
}

layer {
  name: "inception_4d/pool"
  type: "Pooling"
  bottom: "inception_4c/output"
  top: "inception_4d/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "inception_4d/pool_proj"
  type: "Convolution"
  bottom: "inception_4d/pool"
  top: "inception_4d/pool_proj"
  param {
    lr_mult: 0.25
    decay_mult: 1
  }
  param {
